# Pandas Basics

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=['Row1','Row2','Row3','Row4'],columns=['Column1','Column2','Column3','Column4','Column5'])

In [5]:
df

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [6]:
df.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

# Accesing the elements in DataFrame

1. .loc [only row]
2. .iloc [both row and column]

In [11]:
df.loc['Row1'] # When we are only considering single row then we will be getting the values of Column in series

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: Row1, dtype: int32

In [12]:
type(df.loc['Row1'])

pandas.core.series.Series

In [13]:
df.iloc[:]

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [14]:
# df.iloc works exactly like numpy array

In [15]:
# We want the value of Row2 and Row 3 Column 3,4 then
df.iloc[1:3,2:4]

      Column3  Column4
Row2        7        8
Row3       12       13

In [17]:
# We want value of only column2 

df.iloc[:,1:2]

      Column2
Row1        1
Row2        6
Row3       11
Row4       16

In [28]:
df.iloc[:,0]

Row1     0
Row2     5
Row3    10
Row4    15
Name: Column1, dtype: int32

In [27]:
type(df.iloc[:,0])

pandas.core.series.Series

In [29]:
df.iloc[:,2:]

      Column3  Column4  Column5
Row1        2        3        4
Row2        7        8        9
Row3       12       13       14
Row4       17       18       19

In [25]:
type(df.iloc[:,2:])

pandas.core.frame.DataFrame

In [18]:
# Only taking value from Column 3
df.iloc[:,2:]

      Column3  Column4  Column5
Row1        2        3        4
Row2        7        8        9
Row3       12       13       14
Row4       17       18       19

# Convert Dataframe into array

In [20]:
df.iloc[:,2:].values

array([[ 2,  3,  4],
       [ 7,  8,  9],
       [12, 13, 14],
       [17, 18, 19]])

In [21]:
df['Column1'].value_counts() # shows the count of each value that occured in the particular column

15    1
5     1
10    1
0     1
Name: Column1, dtype: int64

# Save to .csv

In [24]:
df.to_csv('Test1.csv')

# Inbuild pandas functions

In [31]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
Column5    0
dtype: int64

# Another way of accesing/indexing value in Dataframe

In [40]:
df['Column1']

Row1     0
Row2     5
Row3    10
Row4    15
Name: Column1, dtype: int32

In [41]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        5        6
Row3       10       11
Row4       15       16